In [4]:
import pandas as pd
df = pd.read_excel("pandas_01_day6.xlsx")
print(df)

    Height  Weight Favourite Dish
0      5.0      75        Biryani
1      5.9      75  Karahi Ghosht
2      5.8      72        Biryani
3      5.7      72        Biryani
4      3.0      62        Biryani
..     ...     ...            ...
82     5.0      50  Chicken Pulao
83     5.6      49  Chicken Pulao
84     5.2      48        Biryani
85     5.0      31        Biryani
86     5.0      25        Biryani

[87 rows x 3 columns]

In [5]:
df.head()

   Height  Weight Favourite Dish
0     5.0      75        Biryani
1     5.9      75  Karahi Ghosht
2     5.8      72        Biryani
3     5.7      72        Biryani
4     3.0      62        Biryani

In [6]:
df.tail(7)

    Height  Weight Favourite Dish
80     5.2      51    Chapel Kaba
81     5.6      50          Pasta
82     5.0      50  Chicken Pulao
83     5.6      49  Chicken Pulao
84     5.2      48        Biryani
85     5.0      31        Biryani
86     5.0      25        Biryani

In [7]:
df.shape

(87, 3)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 87 entries, 0 to 86
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Height          87 non-null     float64
 1   Weight          87 non-null     int64
 2   Favourite Dish  87 non-null     object
dtypes: float64(1), int64(1), object(1)
memory usage: 2.2+ KB

In [9]:
df.index

RangeIndex(start=0, stop=87, step=1)

In [10]:
df.columns

Index(['Height', 'Weight', 'Favourite Dish'], dtype='object')

In [11]:
df.describe()

          Height      Weight
count  87.000000   87.000000
mean    5.494828   70.459770
std     0.464660   16.753899
min     3.000000   25.000000
25%     5.200000   60.000000
50%     5.600000   70.000000
75%     5.800000   80.000000
max     6.200000  125.000000

In [12]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,77,78,79,80,81,82,83,84,85,86
Height,5.0,5.9,5.8,5.7,3.0,5.2,6.0,6.0,6.0,5.1,...,5.5,5.5,5.2,5.2,5.6,5.0,5.6,5.2,5.0,5.0
Weight,75,75,72,72,62,61,50,125,110,103,...,52,52,52,51,50,50,49,48,31,25
Favourite Dish,Biryani,Karahi Ghosht,Biryani,Biryani,Biryani,Pasta,Biryani,Chapel Kaba,Chapel Kaba,Chapel Kaba,...,Karahi Ghosht,Karahi Ghosht,Pasta,Chapel Kaba,Pasta,Chicken Pulao,Chicken Pulao,Biryani,Biryani,Biryani

In [13]:
df.head(12)

    Height  Weight Favourite Dish
0      5.0      75        Biryani
1      5.9      75  Karahi Ghosht
2      5.8      72        Biryani
3      5.7      72        Biryani
4      3.0      62        Biryani
5      5.2      61          Pasta
6      6.0      50        Biryani
7      6.0     125    Chapel Kaba
8      6.0     110    Chapel Kaba
9      5.1     103    Chapel Kaba
10     5.8     101  Chicken Pulao
11     5.1      96        Biryani

In [14]:
df.sort_index(ascending=False)

    Height  Weight Favourite Dish
86     5.0      25        Biryani
85     5.0      31        Biryani
84     5.2      48        Biryani
83     5.6      49  Chicken Pulao
82     5.0      50  Chicken Pulao
..     ...     ...            ...
4      3.0      62        Biryani
3      5.7      72        Biryani
2      5.8      72        Biryani
1      5.9      75  Karahi Ghosht
0      5.0      75        Biryani

[87 rows x 3 columns]

In [15]:
df.sort_values(by="Weight")

    Height  Weight Favourite Dish
86     5.0      25        Biryani
85     5.0      31        Biryani
84     5.2      48        Biryani
83     5.6      49  Chicken Pulao
82     5.0      50  Chicken Pulao
..     ...     ...            ...
11     5.1      96        Biryani
10     5.8     101  Chicken Pulao
9      5.1     103    Chapel Kaba
8      6.0     110    Chapel Kaba
7      6.0     125    Chapel Kaba

[87 rows x 3 columns]

In [16]:
pd.__version__

'2.1.1'

### How to make DataFrame 
###### As of now, we read excel data in to datafram. But now, we will create one inside our code.
> For that, we need to use pd method, and in the argument we will pass dictionary. In the dictionary
> The KEY >> Colname
> The VALUE >> list of values in the column


  |  A column  | B column   |
  |:---------: | :--------: |
  |   3        |     4      |
  |   2        |     5      |

In [17]:
df = pd.DataFrame({'A column':[3,2] , 'B column':[4,5] })
df

   A column  B column
0         3         4
1         2         5

##### We Can create a two dimentional array as we create dataframe using **NUMPY**.

> Here we will 2D array, where 3 rows, 4 cols are there.

In [18]:
import numpy as np

In [19]:
arr = np.array([[1,2,3,4], [5,6,7,8], [8,8,7,6]])
arr

array([[1, 2, 3, 4],
       [5, 6, 7, 8],
       [8, 8, 7, 6]])

In [20]:
np.shape(arr)

(3, 4)

### We can create a random data frame using numpy with dataframe
> As we have shape (5,8), so the coloumn list should have 8 alphabets. Also, "ABCDEFGH" is a string passed to the list function, which converted it into a list of ['A', 'B', 'C' ....]

In [21]:
df = pd.DataFrame(np.random.rand(5,8), columns=list("ABCDEFGH"))
df

,A,B,C,D,E,F,G,H
0,0.737138,0.212092,0.490257,0.188340,0.540232,0.555442,0.078850,0.911646
1,0.423463,0.014900,0.896467,0.233801,0.726173,0.891582,0.016467,0.123509
2,0.480291,0.270198,0.338208,0.787799,0.067101,0.161904,0.634481,0.498766
3,0.531508,0.125075,0.843452,0.444641,0.317265,0.327070,0.578893,0.553308
4,0.525759,0.453051,0.470032,0.637769,0.071294,0.961264,0.076215,0.950345

### How to rename columns

> df.rename(columns={'old_column_name': 'new_column_name'}, inplace=True)

> **Rename multiple columns**\
> df.rename(columns={'old_column1': 'new_column1', 'old_column2': 'new_column2'}, inplace=True)

In [22]:
df.rename(columns={'A':'Anew', 'B': 'Bnew' }, inplace=True)
df

,Anew,Bnew,C,D,E,F,G,H
0,0.737138,0.212092,0.490257,0.188340,0.540232,0.555442,0.078850,0.911646
1,0.423463,0.014900,0.896467,0.233801,0.726173,0.891582,0.016467,0.123509
2,0.480291,0.270198,0.338208,0.787799,0.067101,0.161904,0.634481,0.498766
3,0.531508,0.125075,0.843452,0.444641,0.317265,0.327070,0.578893,0.553308
4,0.525759,0.453051,0.470032,0.637769,0.071294,0.961264,0.076215,0.950345

#### Another easyway to change column name;

> **df.columns=['col_aa','col_bb']**\
> you have to be careful. here u are passing a list of two columns names while in our example there are 8 column so I got the following error when I exet the mentioned thing. While in the first way of changing col name works better in this case.

#### **replace any char, sting in the col name**

In [23]:
df.columns = df.columns.str.replace('n', ' ')
df

,A ew,B ew,C,D,E,F,G,H
0,0.737138,0.212092,0.490257,0.188340,0.540232,0.555442,0.078850,0.911646
1,0.423463,0.014900,0.896467,0.233801,0.726173,0.891582,0.016467,0.123509
2,0.480291,0.270198,0.338208,0.787799,0.067101,0.161904,0.634481,0.498766
3,0.531508,0.125075,0.843452,0.444641,0.317265,0.327070,0.578893,0.553308
4,0.525759,0.453051,0.470032,0.637769,0.071294,0.961264,0.076215,0.950345

#### To add prefix or sufix with the column name
> df = df.add_prefix('baba_')\
> df = df.add_suffix('nana_')

## Using template data from seaborn

In [24]:
# import panadas and numpy , already done
import seaborn as sns

In [25]:
kashti_dataset = sns.load_dataset('tips')
kashti_dataset.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [26]:
# summary of this dataset "tips"
kashti_dataset.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

## Saving Dataset into csv etc

In [27]:
#will create the csv file named 'tipsdatasetcsv.csv' of this dataset and save it in the same folder

kashti_dataset.to_csv('tipsdatasetcsv.csv')

## How to load/read csv or excel file into a dataframe object

In [28]:
df1 = pd.read_csv('tipsdatasetcsv.csv')
df1.head(10)

   Unnamed: 0  total_bill   tip     sex smoker  day    time  size
0           0       16.99  1.01  Female     No  Sun  Dinner     2
1           1       10.34  1.66    Male     No  Sun  Dinner     3
2           2       21.01  3.50    Male     No  Sun  Dinner     3
3           3       23.68  3.31    Male     No  Sun  Dinner     2
4           4       24.59  3.61  Female     No  Sun  Dinner     4
5           5       25.29  4.71    Male     No  Sun  Dinner     4
6           6        8.77  2.00    Male     No  Sun  Dinner     2
7           7       26.88  3.12    Male     No  Sun  Dinner     4
8           8       15.04  1.96    Male     No  Sun  Dinner     2
9           9       14.78  3.23    Male     No  Sun  Dinner     2

# Reverse Row Order

##### We have already imported seaborn as sns, pandas as pd

In [29]:
df2 = sns.load_dataset('titanic')
df2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [30]:
df2.loc[::-1].head()  # so row number 890 comes first and row number 0 as last

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True

In [31]:
# Column reverse , first "survived" will go to last. the values underneath will reamin the same
df2.loc[:, ::-1].head()

,alone,alive,embark_town,deck,adult_male,who,class,embarked,fare,parch,sibsp,age,sex,pclass,survived
0,False,no,Southampton,NaN,True,man,Third,S,7.2500,0,1,22.0,male,3,0
1,False,yes,Cherbourg,C,False,woman,First,C,71.2833,0,1,38.0,female,1,1
2,True,yes,Southampton,NaN,False,woman,Third,S,7.9250,0,0,26.0,female,3,1
3,False,yes,Southampton,C,False,woman,First,S,53.1000,0,1,35.0,female,1,1
4,True,no,Southampton,NaN,True,man,Third,S,8.0500,0,0,35.0,male,3,0

# Selecting column with respect to data type

In [32]:
df2.dtypes  # to see the data types of each col

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [33]:
df2.select_dtypes(include=['category']).head() #this is is not a inplace method so you have to store it in another df, or directory display it

   class deck
0  Third  NaN
1  First    C
2  Third  NaN
3  First    C
4  Third  NaN

In [34]:
df2.select_dtypes(exclude=['category', 'number']).head()

      sex embarked    who  adult_male  embark_town alive  alone
0    male        S    man        True  Southampton    no  False
1  female        C  woman       False    Cherbourg   yes  False
2  female        S  woman       False  Southampton   yes   True
3  female        S  woman       False  Southampton   yes  False
4    male        S    man        True  Southampton    no   True

In [35]:
df3 = pd.DataFrame({'col_A': ['1','2','3','4'], 
                    'col_B':['5','6','7','8']})
df3

  col_A col_B
0     1     5
1     2     6
2     3     7
3     4     8

In [36]:
df3.dtypes  #type will be object string

col_A    object
col_B    object
dtype: object

In [37]:
# Convert into other datatype using 

df3.astype({'col_A':'int64', 'col_B':'int64'}).dtypes

col_A    int64
col_B    int64
dtype: object

In [38]:
pd.to_numeric(df3['col_A'], errors='coerce')

0    1
1    2
2    3
3    4
Name: col_A, dtype: int64

### TO reduce the size of Dataframe

if we don't want to load huge amount of data into our data frame, we can load some fraction of it. It is diff than head(). head() only show top rows data after loading the whole dataset in the DF.

In [39]:
# df4 = sns.load_dataset('titanic')     this will load complete dataset into df4
df4 = sns.load_dataset('titanic')
df4.shape  #having 891 rows, so we want only 0.1 fraction of it, 
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [40]:
df4.sample(frac=0.1).shape  #load only 89 rows now

(89, 15)

In [41]:
### Read from cllipbaord 
df6 = pd.read_clipboard()
## We can save the clipboard data to a csv or excel etc

# df6.to_csv('file_name.csv')

EmptyDataError: No columns to parse from file

In [ ]:
df6

   10   adult_male  891  non-null      bool
0  11         deck  203  non-null  category
1  12  embark_town  889  non-null    object
2  13        alive  891  non-null    object

### Dataframe split into subset, so we will take len(df4) whch is number of row

In [ ]:
from random import random
kashti_1 = df4.sample(frac=0.5, random_state=1)  #into half, randomly
kashti_1.shape  # got 446 out of

(446, 15)

#### # This process will not affect df4

In [ ]:
# now we can't do the same for kashti_2 to get the other half of dataset into it. We Will DROP the indeces 
# of kashti_1 from the df4 and assign the remaining to kashti_2

kashti_2 = df4.drop(kashti_1.index)
kashti_2.shape  #got 445 rows

(445, 15)

In [ ]:
df4.shape

(891, 15)

### To see unique values in a particular column

In [ ]:
df4.sex.unique()

array(['male', 'female'], dtype=object)

In [ ]:
# Now using common concept of python to get only those data in witch sex(column) has the value male
df4[(df4.sex == 'male')].head()  

#break down

# df4[] >>>>>>       as when we get value using indexing or value from a list or dictionary, we do the same like 
# mylist[3] or in case of dic we use mydictionary['khan']

# df4.sex == 'male' >>>>>>>         will return true for all the values of sex which is 'male' . It is a little different
# as it wo'nt return True for just one value. as we are apply this for a complete df4 , so all values will
# be checked.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

In [ ]:
df4.embark_town.unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [ ]:
df4[df4.embark_town == 'Southampton']

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [ ]:
df4[df4.embark_town == 'Southampton'].shape #will show u how many rows having southampton value

(644, 15)

In [ ]:
df4[((df4.embark_town == 'Southampton') | (df4.embark_town == 'Queenstown')) & (df4.sex == 'female')]

# brackets are placed to direct the interpreter that first two conditions will be executed and then the result will be & to 'female' condition

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

# Filtering by Large category

In [ ]:
df4.age.value_counts()

age
24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: count, Length: 88, dtype: int64

In [ ]:
df4.age.value_counts().nlargest(3) # top3

age
24.0    30
22.0    27
18.0    26
Name: count, dtype: int64

Splitting a string into multiple columns

In [ ]:
df8 = pd.DataFrame({'name': ['Dohn Khan', 'Arthur Doe','Jane Ann', 'Smith san'],'location': ['Los Angeles', 'CA C', 'Washington DC', 'Karachi land']})
df8  # so we have in name and location two words names. We want to split both columns into their respective two colmns
# so the total will become 4 cols

         name       location
0   Dohn Khan    Los Angeles
1  Arthur Doe           CA C
2    Jane Ann  Washington DC
3   Smith san   Karachi land

In [ ]:
df8.name.str.split(' ', expand=True)  # in df8, col name, use str class of pandas, in this class use
# split() method. split on basis of ' ' space. expand will create coloumns for both after separation.

        0     1
0    Dohn  Khan
1  Arthur   Doe
2    Jane   Ann
3   Smith   san

In [ ]:
df8.location.str.split(' ', expand=False) # will return a lists of 2 values each if expand is false.

0      [Los, Angeles]
1             [CA, C]
2    [Washington, DC]
3     [Karachi, land]
Name: location, dtype: object

### To make changes to df8, we need to specify on left side 2 cols names for the sepr names and location

In [ ]:
df8[['First_Name', 'Last_Name']] = df8.name.str.split(" ", expand=True)
df8  # First_name and last_name added

         name       location First_Name Last_Name
0   Dohn Khan    Los Angeles       Dohn      Khan
1  Arthur Doe           CA C     Arthur       Doe
2    Jane Ann  Washington DC       Jane       Ann
3   Smith san   Karachi land      Smith       san

In [ ]:
df8

         name       location First_Name Last_Name
0   Dohn Khan    Los Angeles       Dohn      Khan
1  Arthur Doe           CA C     Arthur       Doe
2    Jane Ann  Washington DC       Jane       Ann
3   Smith san   Karachi land      Smith       san

In [ ]:
#### Refining dataframe now, or data manupulation. 
df8 = df8[['First_Name', 'Last_Name', 'location']]  # the name col is gone. we done need it
df8

  First_Name Last_Name       location
0       Dohn      Khan    Los Angeles
1     Arthur       Doe           CA C
2       Jane       Ann  Washington DC
3      Smith       san   Karachi land

### **Aggregate by multiple groups/function**

In [ ]:
df4.groupby('who').count()  # will show all the columns for *who* column values.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,adult_male,deck,embark_town,alive,alone
who,,,,,,,,,,,,,,
child,83,83,83,83,83,83,83,83,83,83,13,83,83,83
man,537,537,537,413,537,537,537,537,537,537,99,537,537,537
woman,271,271,271,218,271,271,271,269,271,271,91,269,271,271

In [ ]:
df4.groupby('sex').count()

,survived,pclass,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
sex,,,,,,,,,,,,,,
female,314,314,261,314,314,314,312,314,314,314,97,312,314,314
male,577,577,453,577,577,577,577,577,577,577,106,577,577,577

### To select some column,, they will go in a list

In [ ]:
df4[['sex', 'class']]

        sex   class
0      male   Third
1    female   First
2    female   Third
3    female   First
4      male   Third
..      ...     ...
886    male  Second
887  female   First
888  female   Third
889    male   First
890    male   Third

[891 rows x 2 columns]

# There is a Trick to use..

In [ ]:
df4.describe() # this will show states of columns which have number values obviously, now I can select 
# from the following table a specific row. Because it is not a table yet, or we can say, df4 is not updated
# we just displayed using decribe() function. See below cell where we will be selecting from the following

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [ ]:
df4.describe().loc[['min', '50%', 'mean']]  # we can give a range of properties ,  .loc['min':'max'] will be out of list now.

      survived    pclass        age     sibsp     parch       fare
min   0.000000  1.000000   0.420000  0.000000  0.000000   0.000000
50%   0.000000  3.000000  28.000000  0.000000  0.000000  14.454200
mean  0.383838  2.308642  29.699118  0.523008  0.381594  32.204208

In [ ]:
df4.describe().loc['min':'max','survived': 'parch'] 

#now 'min':'max' is from describe property. and after , we mentioned col range to include in result.

     survived  pclass     age  sibsp  parch
min       0.0     1.0   0.420    0.0    0.0
25%       0.0     2.0  20.125    0.0    0.0
50%       0.0     3.0  28.000    0.0    0.0
75%       1.0     3.0  38.000    1.0    0.0
max       1.0     3.0  80.000    8.0    6.0

## Reshaping multiindex series.

In [ ]:
df4.survived.mean()  #mean of col survived

0.3838383838383838

In [ ]:
df4.groupby('sex').survived.mean()     #Show mean of col survived, and also by group 'sex'

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

## Conversion of countinous to categorical data 

Let say, we want to categorized age col by some bins(means age range)
df4.cut(df4.age, bins = [0,1,15,22,50,80] , label = ['baby', 'teenager', 'young_adult','old', 'buzarg'])

In [ ]:
pd.cut(df4.age, bins = [0,1,15,22,50,80] , labels= ['baby', 'teenager', 'young_adult','old', 'buzarg'])

0    young_adult
1            old
2            old
3            old
4            old
Name: age, dtype: category
Categories (5, object): ['baby' < 'teenager' < 'young_adult' < 'old' < 'buzarg']

In [ ]:
#if we want to add a new col for category

df4['new_age_cat'] = pd.cut(df4.age, bins = [0,1,15,22,50,80] , labels= ['baby', 'teenager', 'young_adult','old', 'buzarg'])

In [ ]:
df4  # there u go, last col is added

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,new_age_cat
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,young_adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,old
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,old
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,old
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,old
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,old
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,young_adult
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,old
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,old

In [ ]:
# MAPPING
df4.sex.map({'female': 0, 'male':1})  #Can add a new col

0      1
1      0
2      0
3      0
4      1
      ..
886    1
887    0
888    0
889    1
890    1
Name: sex, Length: 891, dtype: int64

# MELT() learn to use it.

Empty DataFrame
Columns: []
Index: []